<a href="https://colab.research.google.com/github/Msanjayds/AI_KISS/blob/master/4.%20Python/9.%20Pandas_Tips.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [4]:
def load_data():
  return pd.read_csv('https://raw.githubusercontent.com/Msanjayds/AI_KISS/master/4.%20Python/Data/titan_train.csv')

df = load_data()

In [6]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
#Include only int and float columns

df.select_dtypes(include='number').head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [13]:
#Select Object type columns
df.select_dtypes(include='object').head()

                                                Name     Sex  ... Cabin Embarked
0                            Braund, Mr. Owen Harris    male  ...   NaN        S
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  ...   C85        C
2                             Heikkinen, Miss. Laina  female  ...   NaN        S
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  ...  C123        S
4                           Allen, Mr. William Henry    male  ...   NaN        S

[5 rows x 5 columns]

In [15]:
#Include Multiple data types|
df.select_dtypes(include=['int','datetime','object']).head()

   PassengerId  Survived  Pclass  ...            Ticket Cabin  Embarked
0            1         0       3  ...         A/5 21171   NaN         S
1            2         1       1  ...          PC 17599   C85         C
2            3         1       3  ...  STON/O2. 3101282   NaN         S
3            4         1       1  ...            113803  C123         S
4            5         0       3  ...            373450   NaN         S

[5 rows x 10 columns]

In [17]:
#Exclude Certain data types
df.select_dtypes(exclude='int').head()

                                                Name     Sex  ...  Cabin Embarked
0                            Braund, Mr. Owen Harris    male  ...    NaN        S
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  ...    C85        C
2                             Heikkinen, Miss. Laina  female  ...    NaN        S
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  ...   C123        S
4                           Allen, Mr. William Henry    male  ...    NaN        S

[5 rows x 7 columns]